InformationRegisters/КадровыеДокументыПоРешениям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КадровыеДокументыПоРешениям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КадровыйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КадровыйПеревод</v8:Type>
						<v8:Type>cfg:DocumentRef.Увольнение</v8:Type>
						<v8:Type>cfg:DocumentRef.ВосстановлениеВДолжности</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратИзОтпускаПоУходуЗаРебенком</v8:Type>
						<v8:Type>cfg:DocumentRef.КадровыйПереводСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботу</v8:Type>
						<v8:Type>cfg:DocumentRef.УвольнениеСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтпускПоУходуЗаРебенком</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуСписком</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Решение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КадровоеРешение</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиКадровыхРешений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиКадровыхРешений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьРешениеОПриемеНаРаботу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРешениеОКадровомПереводе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРешениеОбУвольнении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРешениеОбОтпускеПоУходуЗаРебенком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРешениеОВозвратеИзОтпускаПоУходуЗаРебенком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРешениеОВосстановленииВДолжности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СотрудникиПоРешениямОПриемеНаРаботу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СотрудникиПоРешениямОПриемеНаРаботу</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Решение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РешениеОПриемеНаРаботу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВариантыОплатыТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВариантыОплатыТруда</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФОТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласованныйДоход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РешениеОКадровомПереводе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>РешениеОКадровомПереводе</Name>
			<BasedOn>
				<xr:Item>Catalog.Сотрудники</xr:Item>
				<xr:Item>Document.ЗаключениеМедицинскогоОсмотра</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОбновлениеЗаданийАдаптацииУвольнения</xr:Item>
				<xr:Item>InformationRegister.МероприятияАдаптацииУвольненияПоДокументу</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьПоШтатномуРасписанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласованныйДоход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботаетДистанционно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОплатыТруда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОплатыТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Территория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТерриторииВыполненияРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьПодразделениеИДолжность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьТерриторию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьРабочееМесто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьДистанционнуюРаботу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьОплатуТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимДистанционнойРаботы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыДистанционнойРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МероприятияАдаптацииУвольнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Мероприятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МероприятияАдаптацииУвольнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Comment>Плановый срок исполнения задачи</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РешениеОбОтпускеПоУходуЗаРебенком.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>РешениеОбОтпускеПоУходуЗаРебенком</Name>
			<BasedOn>
				<xr:Item>Catalog.Сотрудники</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОбновлениеЗаданийАдаптацииУвольнения</xr:Item>
				<xr:Item>InformationRegister.МероприятияАдаптацииУвольненияПоДокументу</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МероприятияАдаптацииУвольнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Мероприятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МероприятияАдаптацииУвольнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Comment>Плановый срок исполнения задачи</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/КадровыеРешения/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Связанный с решением приказ.
// 
// Параметры:
//  Решение - ОпределяемыйТип.КадровоеРешение -
// 
// Возвращаемое значение:
//  Неопределено, 
//	ДокументСсылка.КадровыйПеревод, 
//	ДокументСсылка.Увольнение, 
//	ДокументСсылка.ВосстановлениеВДолжности, 
//	ДокументСсылка.ВозвратИзОтпускаПоУходуЗаРебенком, 
//	ДокументСсылка.КадровыйПереводСписком, 
//	ДокументСсылка.ПриемНаРаботу, 
//	ДокументСсылка.УвольнениеСписком, 
//	ДокументСсылка.ОтпускПоУходуЗаРебенком, 
//	ДокументСсылка.ПриемНаРаботуСписком - кадровый документ.
Функция СвязанныйСРешениемПриказ(Решение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Решение", Решение);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КадровыйДокумент
		|ИЗ
		|	РегистрСведений.КадровыеДокументыПоРешениям
		|ГДЕ
		|	Решение = &Решение";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КадровыйДокумент;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ДобавитьПодменюРешенияПоКадровымИзменениям(ОписаниеМеню) Экспорт
	
	ПунктыМеню = Новый Массив;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРешениеОКадровомПереводе") 
		И ПравоДоступа("Добавление", Метаданные.Документы.РешениеОКадровомПереводе) Тогда
		ПунктыМеню.Добавить("Документы.РешениеОКадровомПереводе");
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРешениеОбУвольнении") 
		И ПравоДоступа("Добавление", Метаданные.Документы.РешениеОбУвольнении) Тогда
		ПунктыМеню.Добавить("Документы.РешениеОбУвольнении");
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРешениеОбОтпускеПоУходуЗаРебенком") 
		И ПравоДоступа("Добавление", Метаданные.Документы.РешениеОбОтпускеПоУходуЗаРебенком) Тогда
		ПунктыМеню.Добавить("Документы.РешениеОбОтпускеПоУходуЗаРебенком");
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРешениеОВозвратеИзОтпускаПоУходуЗаРебенком") 
		И ПравоДоступа("Добавление", Метаданные.Документы.РешениеОВозвратеИзОтпускаПоУходуЗаРебенком) Тогда
		ПунктыМеню.Добавить("Документы.РешениеОВозвратеИзОтпускаПоУходуЗаРебенком");
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРешениеОВосстановленииВДолжности") 
		И ПравоДоступа("Добавление", Метаданные.Документы.РешениеОВосстановленииВДолжности) Тогда
		ПунктыМеню.Добавить("Документы.РешениеОВосстановленииВДолжности");
	КонецЕсли;
	
	Если ПунктыМеню.Количество() > 0 Тогда
		ОписаниеМеню.Пункты.Добавить(СотрудникиФормы.РазделМеню(НСтр("ru = 'Решения'"), ПунктыМеню));
	КонецЕсли;
	
КонецПроцедуры

Функция НастройкиКадровыхРешений() Экспорт
	Возврат РегистрыСведений.НастройкиКадровыхРешений.Настройки();
КонецФункции

Процедура УстановитьНастройкиКадровыхРешений(Настройки) Экспорт
	РегистрыСведений.НастройкиКадровыхРешений.УстановитьНастройки(Настройки);
КонецПроцедуры

#Область КадровыеДокументы

Процедура ПриЗаполненииПриемаНаРаботу(ПриемНаРаботуОбъект, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт

	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Сотрудники") Тогда
		// Проверим, есть ли по этому сотруднику решение о приеме на работу?
		Решение = Документы.РешениеОПриемеНаРаботу.РешениеОПриемеНаРаботуПоСотруднику(ДанныеЗаполнения);
		Если Решение = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Сотрудник = ДанныеЗаполнения;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РешениеОПриемеНаРаботу") Тогда
		Решение = ДанныеЗаполнения;
		Сотрудник = Документы.РешениеОПриемеНаРаботу.СотрудникПоРешениюОПриемеНаРаботу(Решение);
	Иначе
		Возврат;
	КонецЕсли;

	ФизическоеЛицо = КадровыйУчет.ФизическиеЛицаСотрудников(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Сотрудник))[0];
	
	СтруктураЗаполнения = Документы.РешениеОПриемеНаРаботу.ДанныеЗаполненияПриемаНаРаботуПоДокументуРешения(
		Решение.ПолучитьОбъект(), Сотрудник, ФизическоеЛицо);
	
	ПриемНаРаботуОбъект.Заполнить(СтруктураЗаполнения);
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ОбработкаЗаполненияКадровогоПриказа(ДокументОбъект, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если Не Метаданные.ОпределяемыеТипы.КадровоеРешение.Тип.СодержитТип(ТипДанныхЗаполнения) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.РешениеОКадровомПереводе") Тогда
		КопируемыеРеквизиты = Новый Массив;
		КопируемыеРеквизиты.Добавить("ДатаНачала");
		КопируемыеРеквизиты.Добавить("ДатаОкончания");
		КопируемыеРеквизиты.Добавить("Подразделение");
		КопируемыеРеквизиты.Добавить("Территория");
		КопируемыеРеквизиты.Добавить("ДолжностьПоШтатномуРасписанию");
		КопируемыеРеквизиты.Добавить("ОбособленноеПодразделение");
		КопируемыеРеквизиты.Добавить("Организация");
		КопируемыеРеквизиты.Добавить("Сотрудник"); 
		КопируемыеРеквизиты.Добавить("ФизическоеЛицо");
		КопируемыеРеквизиты.Добавить("РабочееМесто");
		КопируемыеРеквизиты.Добавить("РаботаетДистанционно");
		КопируемыеРеквизиты.Добавить("ИзменитьПодразделениеИДолжность");
		КопируемыеРеквизиты.Добавить("ИзменитьТерриторию");
		КопируемыеРеквизиты.Добавить("ИзменитьРабочееМесто");
		КопируемыеРеквизиты.Добавить("ИзменитьДистанционнуюРаботу");
		// ЗУПК
		КопируемыеРеквизиты.Добавить("РежимДистанционнойРаботы");
		// ЗУПК
		ЗаполнитьЗначенияСвойств(ДокументОбъект, 
			ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, КопируемыеРеквизиты));
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.РешениеОбУвольнении") Тогда
		КопируемыеРеквизиты = Новый Массив;
		КопируемыеРеквизиты.Добавить("ДатаУвольнения");
		КопируемыеРеквизиты.Добавить("Организация");
		КопируемыеРеквизиты.Добавить("Сотрудник");
		КопируемыеРеквизиты.Добавить("ФизическоеЛицо");
		ЗаполнитьЗначенияСвойств(ДокументОбъект, 
			ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, КопируемыеРеквизиты));
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.РешениеОбОтпускеПоУходуЗаРебенком") Тогда
		КопируемыеРеквизиты = Новый Массив;
		КопируемыеРеквизиты.Добавить("ДатаНачала");
		КопируемыеРеквизиты.Добавить("Организация");
		КопируемыеРеквизиты.Добавить("ОсновнойСотрудник");
		КопируемыеРеквизиты.Добавить("ФизическоеЛицо");
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, КопируемыеРеквизиты);
		ЗаполнитьЗначенияСвойств(ДокументОбъект, ЗначенияРеквизитов);
		ДокументОбъект.Сотрудник = ЗначенияРеквизитов.ФизическоеЛицо;
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.РешениеОВосстановленииВДолжности") Тогда
		КопируемыеРеквизиты = Новый Массив;
		КопируемыеРеквизиты.Добавить("ДатаВосстановления"); 
		КопируемыеРеквизиты.Добавить("Организация"); 
		КопируемыеРеквизиты.Добавить("Сотрудник"); 
		КопируемыеРеквизиты.Добавить("ФизическоеЛицо"); 
		КопируемыеРеквизиты.Добавить("ДолжностьПоШтатномуРасписанию");
		КопируемыеРеквизиты.Добавить("ДокументОснование");
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, КопируемыеРеквизиты);
		ЗаполнитьЗначенияСвойств(ДокументОбъект, ЗначенияРеквизитов);
		
		РеквизитыПозиции = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗначенияРеквизитов.ДолжностьПоШтатномуРасписанию, "Подразделение, Должность");
		ЗаполнитьЗначенияСвойств(ДокументОбъект, РеквизитыПозиции);
		
		ПриказСвязанныйСОснованием = СвязанныйСРешениемПриказ(ЗначенияРеквизитов.ДокументОснование); // ДокументСсылка.Увольнение
		Если ЗначениеЗаполнено(ПриказСвязанныйСОснованием) Тогда
			ДокументОбъект.ДокументУвольнения = ПриказСвязанныйСОснованием;
			ДокументОбъект.ДатаУвольнения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПриказСвязанныйСОснованием, "ДатаУвольнения");
		КонецЕсли;
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.РешениеОВозвратеИзОтпускаПоУходуЗаРебенком") Тогда
		КопируемыеРеквизиты = Новый Массив;
		КопируемыеРеквизиты.Добавить("ДатаВозврата");
		КопируемыеРеквизиты.Добавить("Организация"); 
		КопируемыеРеквизиты.Добавить("ОсновнойСотрудник");
		КопируемыеРеквизиты.Добавить("ФизическоеЛицо");
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, КопируемыеРеквизиты);
		ЗаполнитьЗначенияСвойств(ДокументОбъект, ЗначенияРеквизитов);
		ДокументОбъект.Сотрудник = ЗначенияРеквизитов.ФизическоеЛицо;
		ПриказСвязанныйСОснованием = СвязанныйСРешениемПриказ(ДанныеЗаполнения.ДокументОснование);
		Если ЗначениеЗаполнено(ПриказСвязанныйСОснованием) Тогда
			ДокументОбъект.ДокументОснование = ПриказСвязанныйСОснованием;
		КонецЕсли;
	КонецЕсли;

	ДокументОбъект.Решение = ДанныеЗаполнения;
	
КонецПроцедуры

#КонецОбласти

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//	Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//										общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.13.54";
	Обработчик.Процедура = "КадровыеРешения.ЗаполнитьКадровыеДокументыПоРешениям";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("87676bf9-d384-47b3-a4fa-1430c73bea18");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение списка кадровых документов, введенных на основании решений.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.22.7";
	Обработчик.Процедура = "КадровыеРешения.ЗаполнениеОплатыТрудаВРешенияхОПриемеНаРаботу";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("a3d519ae-4c7c-47fb-ab79-4be3cbd0c39e");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение оплаты труда решений о приеме на работу.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.22.7";
	Обработчик.Процедура = "КадровыеРешения.ЗаполнениеОплатыТрудаВРешенияхОКадровомПереводе";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("6d515790-00d9-4589-9d8b-d6ddfec05202");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение оплаты труда решений о кадровом переводе.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.23.2";
	Обработчик.Процедура = "КадровыеРешения.РаспределениеПрисоединенныхФайловРешенийПоКадровымИзменениям";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("de5cd107-377b-4cf3-9121-edb05012725a");
	Обработчик.Комментарий = НСтр("ru = 'Распределение присоединенных файлов решений по кадровым изменениям.'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.25.11";
	Обработчик.Процедура = "КадровыеРешения.СвязатьСотрудниковСРешениямиОПриемеНаРаботу";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("b37a3649-1b3b-4eef-a0e9-47809cd3424d");
	Обработчик.Комментарий = НСтр("ru = 'Создание новых сотрудников и связывание существующих с решениями о приеме на работу.'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.25.11";
	Обработчик.Процедура = "КадровыеРешения.УстановитьФОКадровыхРешений";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("bbea22b0-9097-4be7-8453-c0cd0c51f54f");
	Обработчик.Комментарий = НСтр("ru = 'Установка функциональных опций использования кадровых решений.'");
	
КонецПроцедуры

#Область ДатыЗапретаИзменения

Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		"Документ.РешениеОбОтпускеПоУходуЗаРебенком", "ДатаНачала", "ПодборПерсонала", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		"Документ.РешениеОбУвольнении", "ДатаУвольнения", "ПодборПерсонала", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		"Документ.РешениеОВозвратеИзОтпускаПоУходуЗаРебенком", "ДатаВозврата", "ПодборПерсонала", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		"Документ.РешениеОВосстановленииВДолжности", "ДатаВосстановления", "ПодборПерсонала", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		"Документ.РешениеОКадровомПереводе", "ДатаНачала", "ПодборПерсонала", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		"Документ.РешениеОПриемеНаРаботу", "ДатаПриема", "ПодборПерсонала", "Организация");
	
КонецПроцедуры

#КонецОбласти

#Область ОбменДанными

// При заполнении таблицы объектов регистрирующих зависимые объекты.
// 
// Параметры:
//  ДанныеРегистрации - ТаблицаЗначений
Процедура ПриЗаполненииТаблицыОбъектовРегистрирующихЗависимыеОбъекты(ДанныеРегистрации) Экспорт
	
	// Метаданные.Документы.РешениеОКадровомПереводе
	НоваяСтрока = ДанныеРегистрации.Добавить();
	НоваяСтрока.ВедущиеМетаданные = Метаданные.Документы.РешениеОКадровомПереводе;
	
КонецПроцедуры

Процедура ДополнитьОбъектыИзмененияОрганизацийФизическихЛиц(МассивОбъектов) Экспорт
	МассивОбъектов.Добавить(Метаданные.Документы.РешениеОПриемеНаРаботу);
	МассивОбъектов.Добавить(Метаданные.Документы.РешениеОКадровомПереводе);
КонецПроцедуры

#КонецОбласти

#Область Печать

// См. УправлениеПечатьюПереопределяемый.ПриОпределенииОбъектовСКомандамиПечати.
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.РешениеОбОтпускеПоУходуЗаРебенком);
	СписокОбъектов.Добавить(Документы.РешениеОбУвольнении);
	СписокОбъектов.Добавить(Документы.РешениеОВозвратеИзОтпускаПоУходуЗаРебенком);
	СписокОбъектов.Добавить(Документы.РешениеОВосстановленииВДолжности);
	СписокОбъектов.Добавить(Документы.РешениеОКадровомПереводе);
	СписокОбъектов.Добавить(Документы.РешениеОПриемеНаРаботу);
	
КонецПроцедуры

#КонецОбласти

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, 
		"d42dbf90-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.РешениеОбОтпускеПоУходуЗаРебенком);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, 
		"d42dbefa-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.РешениеОбУвольнении);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, 
		"d42dc003-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.РешениеОВозвратеИзОтпускаПоУходуЗаРебенком);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, 
		"d42dbfc2-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.РешениеОВосстановленииВДолжности);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, 
		"c091b4dd-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.РешениеОКадровомПереводе);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, 
		"c091b4f1-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.РешениеОПриемеНаРаботу);
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Справочники.РешенияПоКадровымИзменениямПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.РешениеОбОтпускеПоУходуЗаРебенкомПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.РешениеОПриемеНаРаботуПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.РешениеОВосстановленииВДолжностиПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.РешениеОВозвратеИзОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.РешениеОКадровомПереводеПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.РешениеОбУвольненииПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Документы.РешениеОбОтпускеПоУходуЗаРебенком, Истина);
	Списки.Вставить(Метаданные.Документы.РешениеОбУвольнении, Истина);
	Списки.Вставить(Метаданные.Документы.РешениеОВозвратеИзОтпускаПоУходуЗаРебенком, Истина);
	Списки.Вставить(Метаданные.Документы.РешениеОВосстановленииВДолжности, Истина);
	Списки.Вставить(Метаданные.Документы.РешениеОКадровомПереводе, Истина);
	Списки.Вставить(Метаданные.Документы.РешениеОПриемеНаРаботу, Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоСотруднику(ДокументОбъект, ДанныеЗаполнения, ЗаполнятьСотрудника = Истина, ЗаполнятьПозицию = Ложь) Экспорт
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("СправочникСсылка.Сотрудники") Тогда
		Возврат;
	КонецЕсли;
	
	ПоляДанных = ОбщегоНазначенияБЗККлиентСервер.ЗначенияВМассиве(
		"Организация", "ФизическоеЛицо", "ДолжностьПоШтатномуРасписанию");
	КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина, ДанныеЗаполнения, ПоляДанных);
	
	Если КадровыеДанные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	ТекущиеКадровыеДанныеСотрудника = КадровыеДанные[0];
	
	ДокументОбъект.ФизическоеЛицо = ТекущиеКадровыеДанныеСотрудника.ФизическоеЛицо;
	ДокументОбъект.Организация = ТекущиеКадровыеДанныеСотрудника.Организация;
	
	Если ЗаполнятьСотрудника Тогда
		ДокументОбъект.Сотрудник = ДанныеЗаполнения;
	КонецЕсли;
	
	Если ЗаполнятьПозицию Тогда
		ДокументОбъект.ДолжностьПоШтатномуРасписанию = ТекущиеКадровыеДанныеСотрудника.ДолжностьПоШтатномуРасписанию;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьНаличиеДубляДокумента(ДокументОбъект, Отказ) Экспорт
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	ПолноеИмяДокумента = МетаданныеДокумента.ПолноеИмя();
	МодульМенеджера = Документы[МетаданныеДокумента.Имя];
	
	Запрос = Новый Запрос;
	
	Разделитель = "";
	ТекстУсловийПроверки = "";
	ШаблонУсловия = "%1Решение.%2 = &%2";
	
	Для Каждого Поле Из МодульМенеджера.ПоляПроверкиУникальности() Цикл
		
		Если ЗначениеЗаполнено(ТекстУсловийПроверки)
			И Не ЗначениеЗаполнено(Разделитель) Тогда
			Разделитель = "
			|	И ";
		КонецЕсли;
		
		ТекстУсловийПроверки = ТекстУсловийПроверки + СтрШаблон(ШаблонУсловия, Разделитель, Поле);
		Запрос.УстановитьПараметр(Поле, ДокументОбъект[Поле]);
		
	КонецЦикла;
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Решение.Ссылка
	|ИЗ
	|	&ПолноеИмяДокумента КАК Решение
	|ГДЕ
	|	НЕ Решение.ПометкаУдаления
	|	И Решение.Ссылка <> &Ссылка
	|	И &УсловияПроверки";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолноеИмяДокумента", ПолноеИмяДокумента);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловияПроверки", ТекстУсловийПроверки);
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ТекстОшибки = НСтр("ru = 'Документ с такими характеристиками уже есть: %1.'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ТекстОшибки, Выборка.Ссылка), Выборка.Ссылка, , , Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

// Заполнить кадровые документы по решениям.
// 
// Параметры:
//  ПараметрыОбновления - Структура - Параметры обновления:
//	* ОбработкаЗавершена - Булево
Процедура ЗаполнитьКадровыеДокументыПоРешениям(ПараметрыОбновления) Экспорт
	
	Запрос = ЗапросЗаполненияКадровыхДокументовПоРешениям();
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ПараметрыОбновления.ОбработкаЗавершена = Ложь;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.КадровыеДокументыПоРешениям.СоздатьНаборЗаписей();
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
		НаборЗаписей.Отбор.Решение.Установить(Выборка.Решение);
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	КонецЦикла;
	
КонецПроцедуры

Функция ЗапросЗаполненияКадровыхДокументовПоРешениям()
		
	ПустыеРешения = Новый Массив;
	Для Каждого ТипРешения Из Метаданные.ОпределяемыеТипы.КадровоеРешение.Тип.Типы() Цикл
		ПустыеРешения.Добавить(Новый(ТипРешения));
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустыеРешения", ПустыеРешения);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	КадровыеДокументы.Ссылка КАК КадровыйДокумент,
		|	КадровыеДокументы.Решение
		|ИЗ
		|	Документ.ПриемНаРаботу КАК КадровыеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыеДокументыПоРешениям КАК РешенияПоКадровымДокументам
		|		ПО РешенияПоКадровымДокументам.КадровыйДокумент = КадровыеДокументы.Ссылка
		|ГДЕ
		|	НЕ ПометкаУдаления
		|	И КадровыеДокументы.Решение НЕ В (&ПустыеРешения)
		|	И РешенияПоКадровымДокументам.Решение ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КадровыеДокументы.Ссылка КАК КадровыйДокумент,
		|	КадровыеДокументы.Решение
		|ИЗ
		|	Документ.ПриемНаРаботуСписком.Сотрудники КАК КадровыеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыеДокументыПоРешениям КАК РешенияПоКадровымДокументам
		|		ПО РешенияПоКадровымДокументам.КадровыйДокумент = КадровыеДокументы.Ссылка
		|ГДЕ
		|	НЕ КадровыеДокументы.Ссылка.ПометкаУдаления
		|	И КадровыеДокументы.Решение НЕ В (&ПустыеРешения)
		|	И РешенияПоКадровымДокументам.Решение ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КадровыеДокументы.Ссылка КАК КадровыйДокумент,
		|	КадровыеДокументы.Решение
		|ИЗ
		|	Документ.КадровыйПеревод КАК КадровыеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыеДокументыПоРешениям КАК РешенияПоКадровымДокументам
		|		ПО РешенияПоКадровымДокументам.КадровыйДокумент = КадровыеДокументы.Ссылка
		|ГДЕ
		|	НЕ ПометкаУдаления
		|	И КадровыеДокументы.Решение НЕ В (&ПустыеРешения)
		|	И РешенияПоКадровымДокументам.Решение ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КадровыеДокументы.Ссылка КАК КадровыйДокумент,
		|	КадровыеДокументы.Решение
		|ИЗ
		|	Документ.КадровыйПереводСписком.Сотрудники КАК КадровыеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыеДокументыПоРешениям КАК РешенияПоКадровымДокументам
		|		ПО РешенияПоКадровымДокументам.КадровыйДокумент = КадровыеДокументы.Ссылка
		|ГДЕ
		|	НЕ КадровыеДокументы.Ссылка.ПометкаУдаления
		|	И КадровыеДокументы.Решение НЕ В (&ПустыеРешения)
		|	И РешенияПоКадровымДокументам.Решение ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КадровыеДокументы.Ссылка КАК КадровыйДокумент,
		|	КадровыеДокументы.Решение
		|ИЗ
		|	Документ.Увольнение КАК КадровыеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыеДокументыПоРешениям КАК РешенияПоКадровымДокументам
		|		ПО РешенияПоКадровымДокументам.КадровыйДокумент = КадровыеДокументы.Ссылка
		|ГДЕ
		|	НЕ ПометкаУдаления
		|	И КадровыеДокументы.Решение НЕ В (&ПустыеРешения)
		|	И РешенияПоКадровымДокументам.Решение ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КадровыеДокументы.Ссылка КАК КадровыйДокумент,
		|	КадровыеДокументы.Решение
		|ИЗ
		|	Документ.УвольнениеСписком.Сотрудники КАК КадровыеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыеДокументыПоРешениям КАК РешенияПоКадровымДокументам
		|		ПО РешенияПоКадровымДокументам.КадровыйДокумент = КадровыеДокументы.Ссылка
		|ГДЕ
		|	НЕ КадровыеДокументы.Ссылка.ПометкаУдаления
		|	И КадровыеДокументы.Решение НЕ В (&ПустыеРешения)
		|	И РешенияПоКадровымДокументам.Решение ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КадровыеДокументы.Ссылка КАК КадровыйДокумент,
		|	КадровыеДокументы.Решение
		|ИЗ
		|	Документ.ОтпускПоУходуЗаРебенком КАК КадровыеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыеДокументыПоРешениям КАК РешенияПоКадровымДокументам
		|		ПО РешенияПоКадровымДокументам.КадровыйДокумент = КадровыеДокументы.Ссылка
		|ГДЕ
		|	НЕ ПометкаУдаления
		|	И КадровыеДокументы.Решение НЕ В (&ПустыеРешения)
		|	И РешенияПоКадровымДокументам.Решение ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КадровыеДокументы.Ссылка КАК КадровыйДокумент,
		|	КадровыеДокументы.Решение
		|ИЗ
		|	Документ.ВозвратИзОтпускаПоУходуЗаРебенком КАК КадровыеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыеДокументыПоРешениям КАК РешенияПоКадровымДокументам
		|		ПО РешенияПоКадровымДокументам.КадровыйДокумент = КадровыеДокументы.Ссылка
		|ГДЕ
		|	НЕ ПометкаУдаления
		|	И КадровыеДокументы.Решение НЕ В (&ПустыеРешения)
		|	И РешенияПоКадровымДокументам.Решение ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КадровыеДокументы.Ссылка КАК КадровыйДокумент,
		|	КадровыеДокументы.Решение
		|ИЗ
		|	Документ.ВосстановлениеВДолжности КАК КадровыеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыеДокументыПоРешениям КАК РешенияПоКадровымДокументам
		|		ПО РешенияПоКадровымДокументам.КадровыйДокумент = КадровыеДокументы.Ссылка
		|ГДЕ
		|	НЕ ПометкаУдаления
		|	И КадровыеДокументы.Решение НЕ В (&ПустыеРешения)
		|	И РешенияПоКадровымДокументам.Решение ЕСТЬ NULL";
	
	Возврат Запрос;
	
КонецФункции

// Процедура выполняет заполнение данных оплаты труда решений о приеме на работу
//
Процедура ЗаполнениеОплатыТрудаВРешенияхОПриемеНаРаботу(ПараметрыОбновления = Неопределено) Экспорт
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	РешениеОПриемеНаРаботу.Ссылка КАК Решение
		|ИЗ
		|	Документ.РешениеОПриемеНаРаботу КАК РешениеОПриемеНаРаботу
		|ГДЕ
		|	РешениеОПриемеНаРаботу.ВариантОплатыТруда = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыТруда.ПустаяСсылка)";
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Документ.РешениеОПриемеНаРаботу");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ОбновлениеИБ.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
		ОбновлениеИБ.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Решение = Выборка.Решение.ПолучитьОбъект();
			Если ЗначениеЗаполнено(Решение.ДолжностьПоШтатномуРасписанию) Тогда
				Решение.ВариантОплатыТруда = Перечисления.ВариантыОплатыТруда.ФОТ;
			Иначе
				Решение.ВариантОплатыТруда = Перечисления.ВариантыОплатыТруда.СогласованныйДоход;
			КонецЕсли;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Решение);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ОбновлениеИБ.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет заполнение данных оплаты труда решений о кадровом переводе
//
Процедура ЗаполнениеОплатыТрудаВРешенияхОКадровомПереводе(ПараметрыОбновления = Неопределено) Экспорт

	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	РешениеОКадровомПереводе.Ссылка КАК Решение
		|ИЗ
		|	Документ.РешениеОКадровомПереводе КАК РешениеОКадровомПереводе
		|ГДЕ
		|	РешениеОКадровомПереводе.ВариантОплатыТруда = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыТруда.ПустаяСсылка)";
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Документ.РешениеОКадровомПереводе");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ОбновлениеИБ.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
		ОбновлениеИБ.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Решение = Выборка.Решение.ПолучитьОбъект();
			Решение.ИзменитьПодразделениеИДолжность = Истина;
			Если ЗначениеЗаполнено(Решение.ДолжностьПоШтатномуРасписанию) Тогда
				Решение.ВариантОплатыТруда = Перечисления.ВариантыОплатыТруда.ФОТ;
			Иначе
				Решение.ВариантОплатыТруда = Перечисления.ВариантыОплатыТруда.СогласованныйДоход;
			КонецЕсли;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Решение);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ОбновлениеИБ.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет распределение присоединенных файлов решений по кадровым изменениям
//
Процедура РаспределениеПрисоединенныхФайловРешенийПоКадровымИзменениям(ПараметрыОбновления = Неопределено) Экспорт

	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ПрисоединенныеФайлы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РешенияПоКадровымИзменениямПрисоединенныеФайлы КАК ПрисоединенныеФайлы
		|ГДЕ
		|	НЕ ПрисоединенныеФайлы.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИБ.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаДанных.Добавить(
		Метаданные.Справочники.РешенияПоКадровымИзменениямПрисоединенныеФайлы.ПолноеИмя());
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

	НачатьТранзакцию();
	Попытка
		БлокировкаДанных.Заблокировать();
		ОбновлениеИБ.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ПрисоединенныйФайлНовый = ПрисоединенныйФайлПоТипуЗначения(ТипЗнч(Выборка.Ссылка.ВладелецФайла));
			Если ПрисоединенныйФайлНовый = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ПрисоединенныйФайлНовый, Выборка.Ссылка,, "Владелец, Ссылка, Родитель");
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ПрисоединенныйФайлНовый);
			ПрисоединенныйФайлСтарый = Выборка.Ссылка.ПолучитьОбъект();
			ПрисоединенныйФайлСтарый.ПометкаУдаления = Истина;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ПрисоединенныйФайлСтарый);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ОбновлениеИБ.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	КонецЕсли;
	
КонецПроцедуры

Функция ПрисоединенныйФайлПоТипуЗначения(ТипЗначения)
	
	Если ТипЗначения = Тип("ДокументСсылка.РешениеОПриемеНаРаботу") Тогда
		ПрисоединенныйФайл = Справочники.РешениеОПриемеНаРаботуПрисоединенныеФайлы.СоздатьЭлемент();
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.РешениеОбУвольнении") Тогда
		ПрисоединенныйФайл = Справочники.РешениеОПриемеНаРаботуПрисоединенныеФайлы.СоздатьЭлемент();
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.РешениеОВозвратеИзОтпускаПоУходуЗаРебенком") Тогда
		ПрисоединенныйФайл = Справочники.РешениеОПриемеНаРаботуПрисоединенныеФайлы.СоздатьЭлемент();
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.РешениеОВосстановленииВДолжности") Тогда
		ПрисоединенныйФайл = Справочники.РешениеОПриемеНаРаботуПрисоединенныеФайлы.СоздатьЭлемент();
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.РешениеОКадровомПереводе") Тогда
		ПрисоединенныйФайл = Справочники.РешениеОПриемеНаРаботуПрисоединенныеФайлы.СоздатьЭлемент();
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.РешениеОбОтпускеПоУходуЗаРебенком") Тогда
		ПрисоединенныйФайл = Справочники.РешениеОПриемеНаРаботуПрисоединенныеФайлы.СоздатьЭлемент();
	Иначе
		ПрисоединенныйФайл = Неопределено;
	КонецЕсли;
	
	Возврат ПрисоединенныйФайл;
	
КонецФункции

// Связать сотрудников с решениями о приеме на работу.
// 
// Параметры:
//  ПараметрыОбновления - Структура:
//	* ОбработкаЗавершена - Булево
Процедура СвязатьСотрудниковСРешениямиОПриемеНаРаботу(ПараметрыОбновления) Экспорт

	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;

	РешенияБезФизическогоЛица = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ПараметрыОбновления, "РешенияБезФизическогоЛица", Новый Массив); // Массив Из ДокументСсылка.РешениеОПриемеНаРаботу
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("РешенияБезФизическогоЛица", РешенияБезФизическогоЛица); 
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	Решения.Ссылка КАК Ссылка,
		|	Решения.Кандидат КАК Кандидат,
		|	Решения.Организация КАК Организация
		|ИЗ
		|	Документ.РешениеОПриемеНаРаботу КАК Решения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиПоРешениямОПриемеНаРаботу КАК СотрудникиПоРешениям
		|		ПО (СотрудникиПоРешениям.Решение = Решения.Ссылка)
		|ГДЕ
		|	Решения.Проведен
		|	И СотрудникиПоРешениям.Сотрудник ЕСТЬ NULL
		|	И НЕ Решения.Ссылка В (&РешенияБезФизическогоЛица)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Решения.Дата УБЫВ";
	
	ОписаниеДанных = Новый Массив;
	ОписаниеДанных.Добавить(ОписаниеБлокируемыхДанных(Метаданные.Документы.РешениеОПриемеНаРаботу));
	ОписаниеДанных.Добавить(ОписаниеБлокируемыхДанных(Метаданные.Справочники.Сотрудники));
	ОписаниеДанных.Добавить(ОписаниеБлокируемыхДанных(Метаданные.РегистрыСведений.СотрудникиПоРешениямОПриемеНаРаботу));

	Если Не ОбновлениеИБ.НачатьОбновлениеДанных(ОписаниеДанных, ПараметрыОбновления) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ПараметрыОбновления.ОбработкаЗавершена = Ложь;

	Кандидаты = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Кандидат"); // Массив Из СправочникСсылка.Кандидаты
	
	СотрудникиПоКандидатам = ПодборПерсонала.СотрудникиПоКандидатам(Кандидаты);
	ФизическиеЛицаПоКандидатам = Справочники.Кандидаты.ФизическиеЛицаКандидатов(Кандидаты);
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Сотрудник = СотрудникиПоКандидатам.Получить(Выборка.Кандидат);
		Если Сотрудник = Неопределено Тогда
			Если ФизическиеЛицаПоКандидатам[Выборка.Кандидат] = Неопределено Тогда
				ЗаписьЖурналаРегистрации(
					НСтр("ru = 'Обновление информационной базы.Связать сотрудников с решениями о приеме на работу'", 
						ОбщегоНазначения.КодОсновногоЯзыка()),
					УровеньЖурналаРегистрации.Предупреждение, , , 
					СтрШаблон(
						НСтр("ru = 'Для кандидата %1 проведено решение о приеме на работу %2, но при этом не удалось обнаружить физическое лицо.
							 |Для этого решения сотрудник не был создан.
							 |Необходимо создать физическое лицо для кандидата %1, затем перепровести документ.'"),
						Выборка.Кандидат,
						Выборка.Ссылка));
				РешенияБезФизическогоЛица.Добавить(Выборка.Ссылка);
				Продолжить;
			КонецЕсли;
			Сотрудник = КадровыйУчет.НовыйСотрудникФизическогоЛица(
				ФизическиеЛицаПоКандидатам[Выборка.Кандидат], Выборка.Организация);
		КонецЕсли;
		НаборЗаписей = РегистрыСведений.СотрудникиПоРешениямОПриемеНаРаботу.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Решение.Установить(Выборка.Ссылка);
		СтрокаНабора = НаборЗаписей.Добавить();
		СтрокаНабора.Решение = Выборка.Ссылка;
		СтрокаНабора.Сотрудник = Сотрудник;
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	КонецЦикла;
	
	ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);

	ПараметрыОбновления.Вставить("РешенияБезФизическогоЛица", РешенияБезФизическогоЛица);
	
КонецПроцедуры

Функция ОписаниеБлокируемыхДанных(МетаданныеОбъекта)
	Описание = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОписаниеБлокируемыхДанных(МетаданныеОбъекта);
	Описание.ПоляБлокировки.Очистить();
	Возврат Описание;
КонецФункции

Процедура УстановитьФОКадровыхРешений(ПараметрыОбновления) Экспорт

	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК ИспользоватьАдаптациюУвольнение
		|ИЗ
		|	Константа.ИспользоватьАдаптациюУвольнение КАК НастройкаАдаптации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиКадровыхРешений КАК Настройки
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НастройкаАдаптации.Значение = ИСТИНА
		|	И ЕСТЬNULL(Настройки.ИспользоватьРешениеОбОтпускеПоУходуЗаРебенком, ЛОЖЬ) = ЛОЖЬ
		|	И ЕСТЬNULL(Настройки.ИспользоватьРешениеОбУвольнении, ЛОЖЬ) = ЛОЖЬ
		|	И ЕСТЬNULL(Настройки.ИспользоватьРешениеОВозвратеИзОтпускаПоУходуЗаРебенком, ЛОЖЬ) = ЛОЖЬ
		|	И ЕСТЬNULL(Настройки.ИспользоватьРешениеОВосстановленииВДолжности, ЛОЖЬ) = ЛОЖЬ
		|	И ЕСТЬNULL(Настройки.ИспользоватьРешениеОКадровомПереводе, ЛОЖЬ) = ЛОЖЬ
		|	И ЕСТЬNULL(Настройки.ИспользоватьРешениеОПриемеНаРаботу, ЛОЖЬ) = ЛОЖЬ";
	
	ОписаниеДанных = Новый Массив;
	ОписаниеДанных.Добавить(ОписаниеБлокируемыхДанных(Метаданные.РегистрыСведений.НастройкиКадровыхРешений));
	ОписаниеДанных.Добавить(ОписаниеБлокируемыхДанных(Метаданные.Константы.ИспользоватьАдаптациюУвольнение));

	Если Не ОбновлениеИБ.НачатьОбновлениеДанных(ОписаниеДанных, ПараметрыОбновления) Тогда
		Возврат;
	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ПараметрыОбновления.ОбработкаЗавершена = Ложь;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.НастройкиКадровыхРешений.СоздатьНаборЗаписей();
		СтрокаНабора = НаборЗаписей.Добавить();
		СтрокаНабора.ИспользоватьРешениеОбОтпускеПоУходуЗаРебенком = Выборка.ИспользоватьАдаптациюУвольнение;
		СтрокаНабора.ИспользоватьРешениеОбУвольнении = Выборка.ИспользоватьАдаптациюУвольнение;
		СтрокаНабора.ИспользоватьРешениеОВозвратеИзОтпускаПоУходуЗаРебенком = Выборка.ИспользоватьАдаптациюУвольнение;
		СтрокаНабора.ИспользоватьРешениеОВосстановленииВДолжности = Выборка.ИспользоватьАдаптациюУвольнение;
		СтрокаНабора.ИспользоватьРешениеОКадровомПереводе = Выборка.ИспользоватьАдаптациюУвольнение;
		СтрокаНабора.ИспользоватьРешениеОПриемеНаРаботу = Выборка.ИспользоватьАдаптациюУвольнение;
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	КонецЦикла;
	
	ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	
КонецПроцедуры

#КонецОбласти
